{
    #Определение конфигурации по умолчанию для домашнего сервера и сервера идентификации в файле JSON. В нем определяет базовый URL и имя сервера для домашнего сервера и базовый URL для сервера идентификации.
    "default_server_config": {
        #Определение конфигурации по умолчанию для домашнего сервера в файле JSON. В нем указываются базовый URL и имя сервера для домашнего сервера.
        "m.homeserver": {
            "base_url": "https://EXAMPE.COM",
            "server_name": "EXAMPE.COM"
        },
        #Определение конфигурации по умолчанию для сервера идентификации в файле JSON. В нем указывается базовый URL для сервера идентификации, который в данном случае равен "https://vector.im".
        "m.identity_server": {
            "base_url": "https://vector.im"
        }
    },
    #Отключение возможности для пользователей устанавливать пользовательские URL для своего домашнего сервера или сервера идентификации.
    "disable_custom_urls": true,
    #``disable_guests'': true,`` отключает возможность для гостей присоединяться к комнатам без входа в систему. Это означает, что только зарегистрированные пользователи могут присоединяться к комнатам на сервере.
    "disable_guests": true,
    #``"disable_login_language_selector": false,`` ничего не делает в этом JSON-файле, поскольку является комментарий. Однако, если бы он был установлен в `true`, это отключило бы возможность для пользователей выбирать предпочитаемый язык во время процесса входа в систему.
    "disable_login_language_selector": false,
    #``"disable_3pid_login": true`` отключает возможность для пользователей входить в систему, используя сторонние идентификаторы (3PID), такие как адреса электронной почты или номера телефонов. Это означает, что пользователи могут входить в систему только в систему, используя свой идентификатор Матрикс и пароль.
    "disable_3pid_login": true,
    #``brand'': "SAMPLE TEXT",` устанавливает название бренда для клиента Matrix на "SAMPLE TEXT". Это может быть название организации или компании, которая предоставляет клиент Matrix своим пользователям.
    "brand": "SAMPLE TEXT",
    #``branding`` определяет настройки брендинга для клиента Matrix. Он включает URL-адрес для фонового изображения приветствия, URL для логотипа в заголовке страницы аутентификации и массив ссылок нижнего колонтитула, которые могут быть настроены. В этом конкретном примере приветствие фоновый URL и URL логотипа в заголовке установлены в `"IMAGE_URL"`, которые необходимо заменить фактическими URL-адресами изображений. Ссылка в нижнем колонтитуле настроена на отображение текста "Домашняя страница" и ссылки на "https://EXAMPE.COM/".
    "branding": {
        #``welcome_background_url'': "IMAGE_URL",` определяет URL для приветственного фона изображения в настройках брендинга для клиента Matrix. Фактический URL для изображения нужно заменить на `"IMAGE_URL"`.
        "welcome_background_url": "IMAGE_URL",
        #``auth_header_logo_url'': "IMAGE_URL",` определяет URL для логотипа в заголовке страницы аутентификации страницы аутентификации в настройках брендинга для клиента Matrix. Фактический URL для изображения должен быть заменен на `"IMAGE_URL"`.
        "auth_header_logo_url": "IMAGE_URL",
        #``auth_footer_links`` определяет массив ссылок нижнего колонтитула, которые могут быть настроены для страницы аутентификации клиента матрицы. В данном конкретном примере, он устанавливает текст ссылки нижнего колонтитула на "Домашняя страница" и привязывает ее к "https://EXAMPE.COM/".
        "auth_footer_links": [
            {
                "text": "Домашняя страница",
                "url": "https://EXAMPE.COM/"
            }
        ]
    },
    #``integrations_ui_url'': "https://scalar.vector.im/",` определяет базовый URL для пользовательского интерфейса (UI) функции интеграций в клиенте Matrix. Этот URL используется для доступа к UI для настройки и управления интеграциями со сторонними сервисами.
    "integrations_ui_url": "https://scalar.vector.im/",
    #``integrations_rest_url'': "https://scalar.vector.im/api",` определяет базовый URL для REST API функции интеграций в клиенте Matrix. Этот URL используется для доступа к API для настройки и управления интеграциями со сторонними сервисами.
    "integrations_rest_url": "https://scalar.vector.im/api",
    #``integrations_widgets_urls`` определяет массив URL-адресов для виджетов, используемых в интеграциях клиента Matrix. Эти URL используются для доступа к пользовательскому интерфейсу и API для настройки и управления интеграциями со сторонними сервисами. Массив включает URL-адреса для как производственной, так и временной среды.
    "integrations_widgets_urls": [
        "https://scalar.vector.im/_matrix/integrations/v1",
        "https://scalar.vector.im/api",
        "https://scalar-staging.vector.im/_matrix/integrations/v1",
        "https://scalar-staging.vector.im/api",
        "https://scalar-staging.riot.im/scalar/api"
    ],
    #``bug_report_endpoint_url'': "https://element.io/bugreports/submit",` определяет URL-адрес конечной точки для отправки отчетов об ошибках для клиента Matrix. Когда пользователи сталкиваются с ошибками или проблемами с клиентом, они могут использовать эту конечную точку для отправки отчета разработчикам для дальнейшего расследования и решения.
    "bug_report_endpoint_url": "https://element.io/bugreports/submit",
    #``uisi_autorageshake_app'': "element-auto-uisi",` задает имя приложения, которое будет обрабатывать автоматическое восстановление состояния пользовательского интерфейса (UI) для клиента Matrix. "element-auto-uisi" означает, что если пользователь закроет клиент или выйдет из системы, состояние пользовательского интерфейса будет автоматически сохранено и восстановлено при повторном открытии или входе в клиент.
    "uisi_autorageshake_app": "element-auto-uisi",
    #``default_country_code'': "RU",` устанавливает код страны по умолчанию для клиента Matrix на "RU", который является кодом страны для России. Это означает, что когда пользователям будет предложено ввести свой номер телефона для двухфакторной аутентификации или других целей, код страны по умолчанию будет установлен на Россию.
    "default_country_code": "RU",
    #``"show_labs_settings": false`` устанавливает значение свойства `show_labs_settings` на ``false``. Это свойство используется для определения того, следует ли отображать экспериментальные или "лабораторные" функции в настройках клиента Matrix. Установка значения `false` означает, что эти функции будут не будут отображаться.
    "show_labs_settings": false,
    #``features``: {},` определяет пустой объект для свойства `features` в JSON-файле. Это свойство используется для включения или отключения определенных функций в клиенте Matrix. Если задать для него пустой объект, никакие функции не будут включены или отключены по умолчанию.
    "features": {},
    #``"default_federate": true,` устанавливает значение по умолчанию для способности домашнего сервера объединяться с другими серверами Matrix. Если установлено значение `true`, это означает, что домашний сервер будет разрешать #федерацию с другими серверами по умолчанию федерацию с другими серверами по умолчанию.
    "default_federate": true,
    #``"default_theme": "dark",` устанавливает тему по умолчанию для клиента Matrix на "dark". Это означает, что интерфейс клиента по умолчанию будет иметь темную цветовую схему, а не светлую цветовая схема.
    "default_theme": "dark",
    #``roomDirectory'': {"servers": ["EXAMPE.COM"]}` указывает сервер(ы), которые должны быть включены в каталог комнаты. В данном случае только сервер с доменным именем "EXAMPE.COM" будет включен в каталог комнат. Каталог комнат - это функция в Matrix, которая позволяет пользователям искать и находить публичные комнаты на различных серверах.
    "roomDirectory": {
        "servers": [
            "EXAMPE.COM"
        ]
    },
    #``enable_presence_by_hs_url`` - это свойство, которое позволяет клиенту Matrix включать или отключать обновления присутствия для определенных домашних серверов. В данном случае оно устанавливает значение `false` для домашних серверов с URL ``https://matrix.org`` и ``https://matrix-client.matrix.org``, что означает, что обновления присутствия будут отключены для пользователей на этих домашних серверах. Присутствие обновления присутствия относятся к возможности для пользователей видеть онлайн/оффлайн статус других пользователей в их списке контактов или в комнате.
    "enable_presence_by_hs_url": {
        "https://matrix.org": false,
        "https://matrix-client.matrix.org": false
    },
    #``setting_defaults``: {"breadcrumbs": true}` - это установка значения по умолчанию для параметра "breadcrumbs" значение по умолчанию для параметра "breadcrumbs" в true. Это означает, что когда пользователь устанавливает или открывает клиент Matrix в первый раз. в первый раз, настройка "хлебные крошки" будет включена по умолчанию. Хлебные крошки - это функция в клиента Matrix, которая позволяет пользователям легко переходить к предыдущим экранам или страницам.
    "setting_defaults": {
        "breadcrumbs": true
    },
    #Установка предпочтительного домена для интеграции видеоконференций Jitsi в клиенте Matrix на "meet.element.io". Это означает, что когда пользователи инициируют видеозвонок через клиент Matrix, он будет по умолчанию использовать сервис Jitsi, расположенный на "meet.element.io".
    "jitsi": {
        "preferred_domain": "meet.element.io"
    },
    #``элемент_вызова`` определяет настройки для функции вызова элемента в клиенте Matrix. Он включает URL-адрес для сервиса Element Call, максимальное количество участников, разрешенных в одном звонке, максимальное количество участников, разрешенное в #звонке, и название бренда для функции Element Call. URL-адрес службы Element Call установлен на ``https://call.element.io``, максимальное количество участников, разрешенное в вызове, установлено на `8`, а название бренда для функции Element Call установлено на `"Element Call"`. Это означает. что когда пользователи инициируют голосовой или видеовызов через клиент Matrix, он будет использовать сервис Element Call, размещенный на ``https://call.element.io`` по умолчанию, и звонок будет ограничен максимум 8 участниками.
    "element_call": {
        "url": "https://call.element.io",
        "participant_limit": 8,
        "brand": "Element Call"
    },
    #``map_style_url`: "https://api.maptiler.com/maps/streets/style.json?key=fU3vlMsMn4Jb6dnEIFsx"` определяет URL для стиля карты, который будет использоваться в клиенте Matrix. Он использует сервис MapTiler для предоставления стиля карты, и URL включает ключ, необходимый для доступа к нему. к сервису. Это означает, что когда пользователи просматривают карты в клиенте Matrix, они будут стилизованы в соответствии со спецификациями в файле JSON и с использованием сервиса MapTiler.
    "map_style_url": "https://api.maptiler.com/maps/streets/style.json?key=fU3vlMsMn4Jb6dnEIFsx"
}
